export const AGENDA = {
  'Tokyo Trip 2025': [
    {
      date: '14/01/2025',
      events: [
        { time: '18.00', description: 'นัดรวมตัวที่สนามบินสุวรรณภูมิ' },
        { time: '21.00', description: 'Check-in counter' },
        {
          time: '00.15',
          description: 'Take off (เตรียมน้ำดื่มและอาหารไว้เผื่อหิวกลางคืน)',
        },
      ],
    },
    {
      date: '15/01/2025',
      events: [
        { time: '08.00', description: 'Landing' },
        {
          time: '08.30',
          description:
            'Immigration ผ่าน ตม. รับกระเป๋า (*เตรียมชุดกันหนาวใส่กระเป๋าที่เอาออกง่าย อากาศ 2-8°C ใส่ฮีทเทคด้วย)',
        },
        {
          time: '09.00',
          description:
            'ไปขึ้นรถไฟไปรับรถเช่า นัดรถเช่า 12.00น. (*ทุกคนต้องซื้อบัตร Suica เพื่อใช้จ่ายค่ารถไฟ **จ่ายแยก)',
        },
        {
          time: '12.00',
          description:
            'ตรวจเช็ครถ ออกเดินทางไป วัดนาริตะซัง Narita Temple และแวะรับประทานอาหารใกล้วัด ไม่เกิน 13.00น.',
        },
        {
          time: '13.00',
          description:
            'ออกเดินทางไป ฟูจิ (Fujikawaguchiko) ใช้เวลาเดินทาง 3-4 ชม. ระยะทาง 180 กม.',
        },
        {
          time: '16.00',
          description:
            'ถึงหมู่บ้านน้ำใส Oshino Hakkai เดินเล่นในหมู่บ้านประมาณ 1 ชม.',
        },
        { time: '17.00', description: 'ไปดูพระอาทิตย์ตกที่ Lake Yamanaka' },
        {
          time: '17.30',
          description:
            'เข้าเช็คอินโรงแรม Toyoko Inn Kawaguchiko พักที่ฟูจิ 1 คืน',
        },
        {
          time: '19.00',
          description: 'รับประทานอาหารเย็นตามอัธยาศัย',
          recommendations: [
            'Lawson',
            'Kawaguchiko Station',
            'Lake Kawaguchiko',
          ],
        },
      ],
    },
    {
      date: '16/01/2025',
      events: [
        {
          time: '06.00',
          description: 'เจอกันที่ล็อบบี้สำหรับถ่ายรูปที่ถนนเมืองเก่า',
        },
        {
          time: '07.00',
          description: 'เจอกันที่ห้องอาหารโรงแรม รับประทานอาหารเช้า',
        },
        {
          time: '08.00',
          description: 'ออกจากโรงแรม เริ่มเที่ยวในเมืองฟูจิ',
          destinations: [
            'Chureito Pagoda',
            'Tenku no Tori',
            'Oishi Park',
            'Fuji Ten',
          ],
        },
        { time: '12.00', description: 'ทานอาหารเที่ยงที่ Kawaguchiko' },
        { time: '13.00', description: 'คืนรถเช่า' },
        {
          time: '14.00',
          description:
            'ขึ้นรถไฟกลับ Tokyo (ใช้ JR รอบที่ 1 ใช้เวลาเดินทางประมาณ 1.30 ชม.)',
        },
        {
          time: '15.30',
          description:
            'ถึง Tokyo เข้าเช็คอินโรงแรม Sotetsu Fresa Inn Tokyo-Kyobashi',
        },
        {
          time: '',
          description:
            'ช่วงเย็นเดินเที่ยวรอบโรงแรมหรือไป Tokyo Sky Tree (*ค่าเข้าราคา 600 บาท) (**เดินทางโดยใช้รถไฟ Suica จ่ายรายเที่ยว)',
        },
      ],
    },
    {
      date: '17/01/2025',
      events: [
        {
          time: '08.00',
          description: 'พร้อมกันที่ล็อบบี้ (โรงแรมไม่มีอาหารเช้า)',
        },
        {
          time: '09.00',
          description: 'ไป Gala Yuzawa (ใช้ JR *2 ใช้เวลาเดินทาง 1.45 ชม.)',
        },
        { time: '11.45', description: 'ถึง Gala Yuzawa และรอรถบัสโรงแรมมารับ' },
        { time: '12.00', description: 'ทานอาหารที่โรงแรม' },
        {
          time: '13.00',
          description: 'ขึ้นกระเช้า (ค่ากระเช้า 1,600¥ ไม่รวมชุดสกี)',
        },
        {
          time: '',
          description: 'GALA YUZAWA สกี รีสอร์ท',
          details: {
            liftTicket: '6,500¥',
            snowmobile: '1,000¥',
            moonBike: '2,000¥',
            equipmentRental: '5,000¥',
            skiSuit: '6,000¥',
          },
        },
      ],
    },
    {
      date: '18/01/2025',
      events: [
        {
          time: '07.00',
          description: 'เช้าทานอาหาร เตรียมออกเดินทางกลับ Tokyo',
        },
        { time: '10.00', description: 'ขึ้นรถไฟ JR*3' },
        { time: '12.45', description: 'ถึง Tokyo ฝากกระโปรงไว้โรงแรม' },
        {
          time: '14.00',
          description: 'ไป Ueno Zoo (มีค่าเข้า) หรือ Ueno Park',
        },
        {
          time: '16.00',
          description: 'เย็นเดินเล่นที่ตลาด Ameyoko หรือ Shibuya/Shinjuku',
        },
        {
          time: '17.00',
          description: 'เย็นมีร้านปิ้งย่างแนะนำหรือทานตามอัธยาศัย',
        },
      ],
    },
    {
      date: '19/01/2025',
      events: [
        { time: '07.00', description: 'โรงแรมไม่มีอาหารเช้า พัก Ueno ที่เดิม' },
        { time: '08.00', description: 'ไปวัดอาซากุสะ / วัดเซนโซจิ' },
        { time: '13.00', description: 'ช่วงบ่ายไปเกาะโอไดบะหรือ Tokyo Tower' },
      ],
    },
    {
      date: '20/01/2025',
      events: [
        {
          time: '08.00',
          description:
            'เดินทางไป Disneyland อยู่ทั้งวันตั้งแต่เช้าจนมืด รอดูพลุ',
        },
        { time: '22.00', description: 'กลับโรงแรม' },
      ],
    },
    {
      date: '21/01/2025',
      events: [
        { time: '06.00', description: 'ตื่นเช้าไปตลาดปลา' },
        { time: '13.00', description: 'บ่ายว่างเดินซื้อของฝากที่ Shinjuku' },
      ],
    },
    {
      date: '22/01/2025',
      events: [
        { time: '08.00', description: 'ออกเดินทางไปสนามบิน' },
        { time: '17.00', description: 'เดินทางกลับประเทศไทย 🎉' },
      ],
    },
  ],
};
